Revit 2024 API
ElementArray.ForwardIterator Method
Retrieve a forward moving iterator to the array.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public virtual ElementArrayIterator ForwardIterator()
Visual Basic
Public Overridable Function ForwardIterator As ElementArrayIterator
Visual C++
public:
virtual ElementArrayIterator^ ForwardIterator()
Return Value
Returns a forward moving iterator to the array.
See Also
ElementArray Class
Autodesk.Revit.DB Namespace